tap "anomalyco/tap"
tap "aws/tap"
tap "derailed/k9s"
tap "github/gh"
tap "homebrew/bundle"
tap "mas-cli/tap"
tap "norwoodj/tap"
tap "txn2/tap"
tap "warrensbox/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Compiler for writing next generation JavaScript
brew "babel"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Core application library for C
brew "glib"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Color-highlighted diff(1) output
brew "colordiff"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Powerful free data recovery utility
brew "testdisk"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Kubernetes bulk port forwarding utility.
brew "txn2/tap/kubefwd"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch", link: false
# Open source IDE for exploring and testing APIs
cask "bruno"
# Terminal-based AI coding assistant
cask "claude-code"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Developer platform
cask "dotnet-sdk"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# AI coding agent desktop client
cask "opencode-desktop"
# Kubernetes and container management on the desktop
cask "rancher"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# The tfswitch command lets you switch between terraform versions.
cask "warrensbox/tap/tfswitch"
# Open-source code editor
cask "visual-studio-code"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "aws-scripting-guy.cform"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dunstontc.vscode-go-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kazuito.ghostty"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "naco-siren.gradle-language"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "nucllear.vscode-extension-auto-import"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shyykoserhiy.vscode-spotify"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "github.com/mvillumsen/slsa-demo"
go "honnef.co/go/tools/cmd/staticcheck"
npm "corepack"
npm "docx"
npm "google-searchconsole-mcp"
